[
    {   
        "id": 1,
        "title":  "E-commerce Inspirado en Nike con Vanilla JavaScript",
        "description":  "Desarrollo de un sitio web de e-commerce completo con Vanilla JavaScript, demostrando habilidades en la creación de aplicaciones interactivas sin el uso de bibliotecas o frameworks. Implementación de un carrito de compras funcional utilizando LocalStorage para almacenar los datos del carrito, lo que mejora la experiencia del usuario y permite que los artículos se conserven incluso después de cerrar el navegador. Diseño responsive y moderno que se asemeja a la estética de la tienda de Nike, brindando una experiencia de compra atractiva y coherente con la marca.",
        "github": "https://github.com/LeandroF01/E-commerce",
        "link": "https://ecommerecenikeejemplo.netlify.app/",
        "technologies": [{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
      },
    {   
    "id": 2,
    "title":  "Tarjetas de Frases con Cambio de Fondo Aleatorio",
    "description":  "Implementación de la función de geolocalización para determinar automáticamente la ubicación del usuario y mostrar datos climáticos relevantes sin necesidad de ingreso manual. Diseño intuitivo y amigable que facilita la visualización de la información climática, permitiendo a los usuarios obtener rápidamente los datos que necesitan. Integración de una API de pronóstico del clima, proporcionando pronósticos precisos y actualizados para mejorar la planificación diaria de los usuarios.",
    "github": "https://github.com/LeandroF01/QuoteBox",
    "link": "https://statuesque-croquembouche-7d5b9a.netlify.app/",
    "technologies": [{"color":"icons/react.svg", "url":"icons/react.svg"},{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
  },
    {   
    "id": 3,
    "title":  "Seguimiento de Criptomonedas en React",
    "image":  "",
    "description":  "Implementación de una interfaz de facil navegación y la visualización de los datos de las criptomonedas. Uso efectivo de la API de CoinGecko para obtener datos en tiempo real, lo que proporciona a los usuarios información precisa y actualizada sobre las cotizaciones de las criptomonedas. Integración de una funcionalidad de búsqueda que permite a los usuarios encontrar rápidamente monedas específicas y obtener detalles detallados sobre ellas.",
    "github": "https://github.com/LeandroF01/TableCoin",
    "link": "https://table-coin.netlify.app/",
    "technologies": [{"color":"icons/react.svg", "url":"icons/react.svg"},{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
  },

  {   
    "id": 4,
    "title":  "Aplicación del Clima con Geolocalización",
    "image":  "",
    "description":  "Implementación de la función de geolocalización para determinar automáticamente la ubicación del usuario y mostrar datos climáticos relevantes sin necesidad de ingreso manual. Diseño intuitivo y amigable que facilita la visualización de la información climática, permitiendo a los usuarios obtener rápidamente los datos que necesitan. Integración de una API de pronóstico del clima, proporcionando pronósticos precisos y actualizados para mejorar la planificación diaria de los usuarios.",
    "github": "https://github.com/LeandroF01/WeatherApp",
    "link": "https://wheater-app-temp.netlify.app/",
    "technologies": [{"color":"icons/react.svg", "url":"icons/react.svg"},{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
  },
  {   
    "id": 5,
    "title":  "Rick and Morty Universe - Web de Personajes con Animación y Paginación",
    "image":  "",
    "description":  "Desarrollo de una interfaz atractiva y fácil de usar, con animaciones CSS en las tarjetas de personajes que hacen que la experiencia de navegación sea entretenida y dinámica. Implementación de una búsqueda funcional que permite a los usuarios encontrar personajes específicos por nombre o información relevante. Uso de la API de Rick and Morty para obtener datos sobre los personajes, organizándolos por planetas aleatorios para brindar una experiencia de descubrimiento única. Creación de un sistema de paginación para dividir los personajes en grupos manejables, lo que agiliza la carga y mejora la experiencia de usuario.",
    "github": "https://github.com/LeandroF01/rick-and-morty",
    "link": "https://rick-and-morty26.netlify.app/",
    "technologies": [{"color":"icons/react.svg", "url":"icons/react.svg"},{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
  },
  {   
    "id": 6,
    "title":  "Web de Pokémon con Animaciones, Paginación y Detalles de los Pokémon",
    "image":  "",
    "description":  "Desarrollo de una página principal interactiva con animaciones de bienvenida que cautivan a los visitantes y los invitan a explorar la PokéDex. Implementación de una paginación eficiente que permite a los usuarios descubrir una amplia variedad de Pokémon sin problemas. Detalles completos de los Pokémon en cada tarjeta, incluidos el tipo, estadísticas y habilidades, proporcionando una visión detallada de cada criatura. Diseño responsivo que garantiza una experiencia de usuario óptima en dispositivos móviles y de escritorio.",
    "github": "https://github.com/LeandroF01/pokedex",
    "link": "https://pokedex-pokex.netlify.app/",
    "technologies": [{"color":"icons/react.svg", "url":"icons/react.svg"},{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
  },
  {   
    "id": 7,
    "title":  "Juego del TaTeTi",
    "image":  "",
    "description":  "Implementación completa del juego del TaTeTi con lógica y reglas adecuadas para determinar el resultado de cada partida. Almacenamiento persistente de los resultados de los partidos en el LocalStorage, lo que permite que los jugadores continúen sus partidas incluso después de cerrar y volver a abrir la página. Diseño responsivo y amigable con animaciones suaves que hacen que el juego sea visualmente atractivo y fácil de jugar. Interfaz intuitiva y fácil de usar que permite a los jugadores disfrutar del juego sin problemas.",
    "github": "https://github.com/LeandroF01/tateti",
    "link": "https://tateti-react.netlify.app/",
    "technologies": [{"color":"icons/react.svg", "url":"icons/react.svg"},{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
  },
  {   
    "id": 8,
    "title":  "E-commerce con React, Redux y React Router",
    "image":  "",
    "description":  "Implementación de un sistema de autenticación seguro que permite a los usuarios registrarse, iniciar sesión y acceder a las funciones de compra. Carrito de compra totalmente funcional que permite a los usuarios agregar y eliminar productos antes de finalizar su compra. Detalle de productos con información completa, como imágenes, descripciones y precios, proporcionando una visión detallada de cada artículo. Historial de compras que muestra a los usuarios sus pedidos anteriores, lo que facilita el seguimiento de sus transacciones. Filtros en la página de productos para una navegación eficiente, lo que permite a los usuarios encontrar rápidamente los productos que desean.",
    "github": "https://github.com/LeandroF01/e-commerce-react",
    "link": "https://e-commerce-react-it.netlify.app/",
    "technologies": [{"color":"icons/react.svg", "url":"icons/react.svg"},{"color":"JavaScript", "url":"icons/javascript.svg"},{"color":"icons/css-3.svg", "url":"icons/css-3.svg"},{"color":"icons/html-5.svg", "url":"icons/html-5.svg"}]
  }
]